{"_id":{"$oid":"610d01fe9a63eb113d221f7b"},"imdb_tconst":"tt0001498","imdb_user":"deickemeyer","imdb_user_review_topic":"The picture has bits of historic realism that are quite clever\\n","imdb_user_review":"The Battle of Trafalgar, arresting as it did the power of Napoleon, just when that power seemed to develop into omnipotence, is justly counted among the fifteen decisive battles of history. A film maker, who undertakes to reproduce an event of such importance in moving pictures, deserves encouragement for the effort alone. It may be added at the outset that the effort of the Edison Company was altogether creditable. The picture has bits of historic realism that are quite clever. The \\\"fighting top\\\" of the enemy's ship \\\"The Redoubtable\\\" was an extremely well-conceived and well executed scene and has the merit of being in the story of it well sustained by historical tradition. The scene on board the \\\"Victory\\\" when, after so many hours of bloody fighting the fortunes of war went with the British, is stirring in the picture, as it must have been in reality. The death of Nelson was an affecting scene and to an Englishman must bring to mind one of the proudest moments in the history of his country. The appearance of Nelson before the Board of Admiralty is likewise worthy of special mention. The psychological moment has been seized by the director, and the spectator at the end of the scene feels that Nelson is going forth to conquer or to die. Special credit is due to the film maker for abstaining from the \\\"love-fiction\\\" too often interwoven with so- called historical pictures. The historical novel has been the pet aversion of literature and it would be too bad to have a revival of it on the screen. The educational value of the picture is great. - The Moving Picture World, September 9, 1911","imdb_user_review_date":"5 April 2016","imdb_n_helpful_vote":null,"imdb_t_vote":null,"url":"https://www.imdb.com/title/tt0001498/reviews","spider":"imdb_user_review","date":{"$date":"2021-07-26T00:00:00.000Z"},"imdb_user_rating":null}