{"_id":{"$oid":"610d01fe9a63eb113d221f7c"},"imdb_tconst":"tt0001592","imdb_user":"F Gwynplaine MacIntyre","imdb_user_review_topic":"Turgid soap opera, in early Danish.\\n","imdb_user_review":"I saw this Danish silent film in October 2006 at the Cinema Muto festival in Sacile, Italy. Its title doesn't readily translate into English; I would render it as 'Expediency'.Edgar Geheimraaden is a wealthy young man who meets a beautiful shopgirl named Ebba, and they straight away fall in love. They begin to date, and three months later Ebba is pregnant. Up until this point, Edgar has shown no interest in marrying Ebba, but now he starts planning their wedding with surprising alacrity. (Will they go on an Ebba-Debba honeymoon?) When his parents learn of Edgar's plans, his father persuades him not to go ahead ... because of the class differences between Edgar and Ebba, of course. Hoping that Edgar will forget about Ebba, his father sends the young swain to live with his (the father's) rural friends the Laege family. Indeed, the Laeges also have an attractive young daughter, Lily.SPOILERS AHEAD. When Edgar confides in Lily, she persuades him to write to Ebba through the intermediary of Ebba's employer, the shopkeeper ... although at this point Ebba's pregnancy is too far advanced for her to keep her job. Edgar's father contrives to intercept the letters. Believing that Edgar does not care about her, Ebba gives birth to her child ... then dies in hospital. When Edgar and Lily learn this, they plan to marry and adopt the child.Zanny Petersen, the brunette actress who portrays Lily, is quite attractive but her complexion is surprisingly dark: more surprisingly since she's a Scandinavian. I kept thinking perhaps she was wearing too much make-up.'Ekspeditricen' is a turgid slice of soap opera which reveals the morals of its time, yet also hypocritically manages to have its Danish pastry and eat it too. Edgar impregnates a working-class woman and goes merrily on his way ... yet he also manages to take responsibility for the child without marrying beneath his station. (Lily is of a higher social class than Ebba.) The film's attitude towards Ebba seems to be that the dirty slut had sex without getting married, so she deserves to die in poverty. I was intrigued by this film's (too few) exterior shots for the glimpses they gave me of Danish scenery in 1911, but I found this movie's story (and the actors' histrionics) quite depressing. This is (so far) the earliest film I've seen which uses the cinematic device of an insert shot of a newspaper article. Mostly for its historic value, I'll rate this one 4 out of 10. The movie's director, August Blom, made better and more significant films during this same period.","imdb_user_review_date":"22 June 2007","imdb_n_helpful_vote":0,"imdb_t_vote":0,"url":"https://www.imdb.com/title/tt0001592/reviews","spider":"imdb_user_review","date":{"$date":"2021-07-26T00:00:00.000Z"},"imdb_user_rating":4}