{
	"id": "9",
	"title": "A glorious, timeless nightmare",
	"by": "Flagrant-Baronessa",
	"date": "25 July 2006",
	"review": "Dark, deep, uncertain, unsettling  imagine the most
	beautiful nightmare you've ever had  this is Blade Runner (1982).
	
	Ridley Scott's Blade Runner is a brilliantly crafted science fiction
	film that not only touches upon, but bravely plunges into deep
	philosophical questions, making it simply ten times more important than
	any film of its genre. I love it not only for the initial feeling it
	gives, but because of its perseverance  none of the visuals, themes or
	technology feel dated but as deep, gripping and current as ever. It is
	timeless beauty with huge doses of emotion.
	
	Set in 2019 Los Angeles, Blade Runner zooms in on the eerily-lit, urban
	streets of the city and follows Richard Deckard  superbly played by
	Harrison Ford who brings an exquisite moral ambiguity to his character 
	a special policeman who tracks down and terminates artificially-created
	humans called replicants, who have escaped from an Off-World colony and
	made their way to earth and need to be stopped. The things Deckard
	encounters on his detective journey raise many philosophical questions
	like: Who is really a replicant? Are replicants really bad? If
	replicants are bad, when why did we go to such lengths with our
	technology to create them? Are replicants really humans? Is Deckard a
	hero? This truly is a film that demands subsequent discussion and its
	ambiguous ending leave a haunting and eerie feeling.
	
	In spite of a rich glaze of science fiction and futurism coating this
	adventure, there are distinct film noir elements present  primarily in
	the bluish haze that the film is seen through and its gritty urban
	atmosphere. Whoever thought of this combination is a genius. Since it is
	all about technology, it fits then that Blade Runner features a
	ridiculous amount of product placement, especially from Atari. In any
	other film, this would have felt out-of-place but here it is simply
	perfect. The score by Vangelis is strangely gripping when combined with
	the striking cinematography of the film.
	
	Blade Runner deserves credit, celebration and remembrance for it is
	simply an excellent film. 
	
	10 out of 10 (and I don't just throw this grade out like SOME people)"
}