{
	"id": "6",
	"title": "Gentlemen, you can't fight in here! This is the War Room.",
	"by": "elvircorhodzic",
	"date": "29 July 2017",
	"review": "DR. STRANGELOVE.... is a satirical black comedy or rather an
	ironic approach to decisions and information in the Cold War madness.
	The smart choice is the mother of all wisdom. It is loosely based on
	Peter George's novel \"Red Alert\".
	
	A crazy American general has ordered, due a bizarre reason, a nuclear
	attack on the Soviet Union. A bit absentminded captain has realized that
	a general has lost his mind. Meanwhile, a President meets with his top
	Pentagon advisors, including a passionate super-hawk general, who sees
	this as an opportunity to do something about Communism in general and
	Russians in particular. However, the Russians have an \"automatic\"
	response...
	
	This film loses all touch with the reality on the one side, and yet, it
	directly affects an image of a disturbed political reality on the other
	side. The irony stems from human stupidity, irresponsibility, suspicion
	and arrogance. Mr. Kubrick has created a satirical hopeless situation,
	through a conflict of mentality and a sense of patriotism, after which,
	a bizarre - moral winner rises. The highlight of satire is that world
	diplomacy rejects itself on multiple occasions.
	
	However, there is a lot of questions. Why give so much power in hands of
	a few people? One of them, I mean all, are mostly crazy. Why use energy
	resources to build nuclear weapons? Probably because we do not have
	better things to do. Is it wise to make fun of a defense system of the
	strongest force in the world? Of course it is, one day, we have to stop
	being afraid of each other.
	
	That's why this film is a satirical warning in an universal time,
	because we live in a time of a political satire with very serious
	consequences.
	
	I am thrilled with a fact that this film does not have a trace of
	cynicism. Of course, there is plenty of satire, sarcasm, irony, perhaps
	exaggerated caricature, but there is no cynicism. Mr. Kubrick, you're a
	genius! The characterization is excellent.
	
	Peter Sellers (Captain Lionel Mandrake, President Merkin Muffley and Dr.
	Strangelove, the wheelchair-using nuclear war expert and former Nazi) is
	simply awesome as a kind of voice of reason, incompetence and insanity
	at the same time. It is a strange kind of patriot, savior and avenger.
	
	Sterling Hayden (Brigadier General Jack D. Ripper) is a paranoid
	ultra-nationalist, who shows his madness through a serious facial
	expression.
	
	George C. Scott (General Buck Turgidson) is the personification of
	chauvinism. He expresses his anger and paranoia of communism in a very
	comical way."
}