{
	"id": "4",
	"title": "Dirty, funny, sexy, violent and unabashedly romantic: Deadpool
	has arrived!",
	"by": "gogoschka-112",
	"date": "February 2016",
	"review": "I really, really liked Deadpool. And you know what? I didn't
	expect to. Seriously, I was never a fan of the character (in the sense
	that I hardly knew anything about him) and the humor as well as the
	violence seemed forced and overdone in the trailers. Still, I remained
	interested in the film, I just never expected it to actually be good -
	until the reviews arrived. After most critics unexpectedly showered this
	newest superhero movie with praise, I went in cautiously optimistic (but
	still fully prepared to hate the film).
	
	The first thing I noticed was how inventive the storytelling is. The
	film throws you into the action from the first moment (literally: the
	very first moment) and then it goes back and forth in brilliant and
	unexpected ways to slowly unspool the story of this insane - but oddly
	charming - antihero. Flashbacks and fast-forwards can be annoying as
	hell, but when done right, they can help render even a somewhat simple
	story fresh and exciting. And that's exactly how Deadpool felt to me
	right from the start: like a fresh (if somewhat dirty) jolt of energy.
	
	The action itself is beautifully designed, employing playful visuals and
	using pretty much every camera technique available; it never feels
	repetitive and the pacing is close to perfection. But, and that was
	probably the key to me liking the film so much, there's a beating heart
	underneath all the action and carnage, and that has a lot to do with how
	brilliantly Ryan Reynolds portrays the character and the great chemistry
	he has with co-star Morena Baccarin. What came as a complete surprise to
	me was how unabashedly romantic Deadpool is. The love story in this film
	is probably the most sincere I've ever seen in a superhero movie and it
	gives the film the strong emotional core which so many of these movies
	lack.
	
	The humor, which I initially feared would just be non-stop juvenile
	wisecracks and soon become distracting, also works surprisingly well.
	Not every line or every joke lands - but that's the beauty of this
	character: they don't really need to. Deadpool can't help himself; as
	long as he's able to breathe he'll crack wise and make fun of himself
	and those around him. It's a clinical condition; he's not a stand-up
	comedian whose jokes need to land: he's a madman (albeit a very
	entertaining one) and the comedy in his case is born out of tragedy.
	
	Despite all my praise, it's not a perfect film. The villain in this
	revenge tale could be more memorable and the story itself is a bit too
	derivative to really do its highly unconventional protagonist (he
	insists he's not a hero) justice: but it's a damn good first entry in a
	franchise that will hopefully explore the character and his world to a
	much larger extent in the sequel(s). And it's actually a very important
	film for another reason. If Deadpool is a financial success - which at
	this point is already clear it will be - this could play a vital role in
	how studios henceforth view the financial prospects of R-rated superhero
	films, and we'll hopefully see more of them in the future.
	
	Many people might feel different - and I respect their opinion - but
	I've grown tired of the entirely bloodless CGI overkill in all those 200
	million productions where even the most terrible villains talk like
	Mormon schoolgirls. I mean: there's a gigantic audience out there that
	is over the age of 18, loves to read comic books and can absolutely
	handle real-world language, real-world sex and real-world violence in
	superhero movies. This genre is so diverse; it's ridiculous to believe
	just because comic books have pictures in them all film adaptations -
	regardless of the material - must automatically be made for kids in
	order to be successful.
	
	As it is, I think Deadpool - a dirty, funny, sexy and violent film which
	is decidedly NOT for kids - just proved my point perfectly. 8 stars out
	of 10.
	
	Favorite films: IMDb.com/list/mkjOKvqlSBs/
	
	Lesser-Known Masterpieces: imdb.com/list/ls070242495/
	
	Favorite Low-Budget and B-Movies: imdb.com/list/ls054808375/
	
	Favorite TV-Shows reviewed: imdb.com/list/ls075552387/"
}